#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
random_password.flyte_db_password: Refreshing state... [id=none]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
data.google_client_config.default: Reading...
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.196.53.249" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUoxSjREMTRYVFFtUVhlRmw3ZzM4K3d3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09HWTVOakJoT1RVdFlqa3lOUzAwT0RBd0xUbGxNak10TVRjMU1qWXlPRFJtTmpsaQpNQ0FYRFRJek1EY3hOREl6TURZeE9Gb1lEekl3TlRNd056QTNNREF3TmpFNFdqQXZNUzB3S3dZRFZRUURFeVE0ClpqazJNR0U1TlMxaU9USTFMVFE0TURBdE9XVXlNeTB4TnpVeU5qSTROR1kyT1dJd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDS3NadnhFNHBBT3diM0dMMGtCM3Nnd1I3d2NUWmFDYXBZN2h2aAptZlFId2xPRTlTYnZ1ejY4K2dnQkF6SmN5SS91V09aN0h0Slo3UWQzRC83dWxzYlhRNW12ckF4QVZJcVhia3N3Ck9xM0F4WFcyR3VKUFJEQTMxazhoTDhBMFo1aHRKYlRNWE10UEJRbE1RdHdRZ1pEUVZKUVdDbmcrenpuMkcrT2cKdENBbVhFbmFkcnNqeVpZQ0ZLV1B4YVpTN0JEWHJpdmJkUzFzSmEzL05QUTU1dktUM3FZd3dCQWRya3Bub2VnZQpnWDZFQ2NGQmVMaWVvZjZTY3F1R3VBa24ybUxtWnJuVWFnZDVNTmk2bmZqbEE3VjI0Z3o4SVljeWUrUFBHZnNxCklHTzlWS1VpOEtORk9hZDcwT1o1RkdJdi9kQ3VVcGRNWnVuV3NrR0FOWERmb0tsMFMrYUtUQWtOa3o1OU14cTAKUmFPYXhjZlg5eDc2YXhTN1FPdmpuN2M0bjVSSWZWT0ZxNjJVWHJRNUpkNXJOWGlNdDVsWittUzlycnRhWStVWApwS2RFK291THhLSlVXQWFLQStOMWVHMGM2ck55clRVM2VORFFPS2ttT2FoRmVETGRQQWJnTGVLdC9yZGtvdGdVCmwwWUhycDA4TXJ5SytyK0syalF6aHVXVERza0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSWFtNTRDSUNVMVZxbzkxVTdwL0luNlU0Mm9FTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQkJqUVRkdTZoenM0ZVpVT1ZIb2IyNlJsb1ZtcHhRNElyemFiV210eW5qCmRYUEtCS0RGa3U3QjZnaWhDWnA0ZGlNQmhPeUtaajZha2xXWnlnUDNnczQxS3ZJYlAwcG9wTG1KSWk4NkdKVWwKN3JhMUFkMjR5TFN1cDU3K2FpYklsMCtQUEpmN3B5M2JsbjcwTVMwU0J2THY5bFZLbGpVTXhlVVVHMGpNRk5UbgpQT2wzd01KbXhCdEtqcUZsdkhKVEdaYzljNXE1QTBkS1lTUU9vTFg3Z2Y1UE9uVjFNc0IzODR3WDhtVFJpRmZlCngyeUVjRXRReVZzd2o3aGlaVElIV3Z1ZjJLM3UwdEpzdjJHMi82RlpzbEtTMUVoajd3Ky8vWlZWdWppeFJzYlgKMlB0MHd4OWpUZnE0aTZUTGhVdDRjUXV5L3ZNbGlKbWcwZ3FjM21oVU9ndDdPK3JJTUpJeU1Ubzltb1Q3RS95WgpwMzF5ZnJLNHVFRWVoTHFNNkJrdktGeU9BWVRabUN4SG5oZHhJZUYwREVoQjVmSjZick8yaE9GWlJ5OTlQdVUzCnVSelBRejl1em1FWTUvWnV1V2tweDFGZnVmelNxL2o5VnNzOTkxdDBDc2J1VUsva08rZFVna0RQbFlVZnZKQk8KMnc0YkszeFY2U3FLaG5UcURDMmkvaVE9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = false -> true # forces replacement
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 10 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (3 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-np-0b75e656-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-np-0b75e656-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.44" -> null
          - public_endpoint         = "35.196.53.249" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_project_iam_custom_role.flyte_backend_role will be updated in-place
  ~ resource "google_project_iam_custom_role" "flyte_backend_role" {
        id          = "projects/exemplary-tide-379122/roles/flyteBackendRole"
        name        = "projects/exemplary-tide-379122/roles/flyteBackendRole"
      ~ permissions = [
          + "container.clusters.getCredentials",
            # (12 unchanged elements hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flyteorg.github.io/flyte"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.8.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*